TestThesis/constant/laserProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      laserProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Accepted keys for femtosecondLaserModel:
//   peakIntensity       [W/m^2]
//   pulseWidth          [s]
//   wavelength          [m]
//   absorptionCoeff     [1/m]
//   spotSize            [m]
//   pulseEnergy         [J]
//   direction           (vector)
//   focus               (point)
//   scanVelocity        (vector, optional)
//   pulseFrequency      [1/s, optional]
//   pulseDutyCycle      [-, optional]
//   reflectivity        [-]
//   gaussianProfile     [bool]
//   maxReflections      [label]
//   continuousLaser     [bool]
//   laserStartTime      [s]
//   laserEndTime        [s]
//   offFilmScale        [-, optional, default 0.1]
//   offFilmMax          [W/m^3, optional, default 1e14]
// Parameter checks enforce pulseWidth 10fs–10ps, wavelength 100nm–2µm
// and peakIntensity ≤1e16 W/m^2.
// Gaussian pulse focused in the 2 µm metal film (y=8–10 µm)
// Domain: x∈[0,50e-6], y∈[0,20e-6], z∈[0,10e-6]

// geometry coupling
filmYMin    8e-6;
filmYMax    #calc "$filmYMin + 7.14e-8"; // 71.4 nm donor film thickness
offFilmScale    0.1;       // Intensity scaling outside donor film [-]
offFilmMax      1e14;      // Max volumetric intensity outside film [W/m^3]
// --- Energy & timing ---
// Boosted energy/intensity to reach melt/ablation threshold
pulseEnergy     4.2e-8;          // [J] total energy
pulseWidth      150e-15;       // [s] 150 fs pulse width
laserStartTime  0;             // [s]
laserEndTime    #calc "$laserStartTime + $pulseWidth"; // [s]

// --- Spatial Gaussian (match the box center and film depth) ---
spotSize        6e-6;         // [m] beam diameter

// Put the beam center inside the domain (mid x,z; inside metal at y≈9.5 µm)
focus           (25e-6 9.5e-6 5e-6);
direction       (0 1 0);

// --- Wavelength / interaction ---
wavelength          1.03e-6;  // [m]

// Absorption
absorptionCoeff     5e7;      // [1/m] ~20–50 nm optical depth

// Reflectivity / profile
reflectivity        0.55;
gaussianProfile     true;
maxReflections      1;

// Optional intensity entry (consistent with pulseEnergy & pulseWidth)
peakIntensity       1e16;      // [W/m^2] from pulseEnergy
continuousLaser     false;

// ************************************************************************* //
