TestThesis/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    yMax
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }
    yMin
    {
        type            zeroGradient;
        
    }
    xMin
    {
        type            zeroGradient;
    }
    xMax
    {
        type            totalPressure;
        p0              uniform 0;
        value           uniform 0;
    }
    zMin
    {
        type            zeroGradient;
    }
    zMax
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
