TestThesis/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solvers
{
    "alpha.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;           // Relaxed tolerance
        relTol          0.1;            
        maxIter         50;             
        
        nAlphaCorr      2;              
        nAlphaSubCycles 1;              
        cAlpha          0.2;            // Conservative interface compression
        icAlpha         0;              
        scAlpha         0;              
        MULESCorr       false;          
        nLimiterIter    3;              
        alphaApplyPrevCorr false;       
    }
    
    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;           // Good enough for millisecond scale
        relTol          0.01;           
        maxIter         100;            
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }
    
    p_rghFinal { $p_rgh; relTol 0; }
    
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;           
        relTol          0.1;            
        maxIter         50;             
    }
    
    UFinal { $U; relTol 0; }
    
    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;           
        relTol          0.1;            
        maxIter         50;             
    }
    
    Te
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;           // Very relaxed
        relTol          0.1;            
        maxIter         50;             
    }
    
    Tl
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;           
        relTol          0.1;            
        maxIter         50;             
    }
}

PIMPLE
{
    momentumPredictor           true;   
    nOuterCorrectors            3;      // Reduced - don't need so many
    nCorrectors                 2;      
    nNonOrthogonalCorrectors    0;      
    
    outerCorrectorResidualControl
    {
        p_rgh   { tolerance 1e-5; relTol 0; }
        U       { tolerance 1e-5; relTol 0; }
    }
    
    p_rghRefCell                0;
    p_rghRefValue               100000;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.5;            
        "alpha.*"       0.5;            
    }
    equations
    {
        U               0.3;            // More aggressive - stable at this scale
        UFinal          1.0;            
        T               0.5;            
        Te              0.5;            // Still conservative for electron temp
        Tl              0.5;            
        
        ".*Final"       1.0;            
    }
}
relaxP      0.3;   // pEqn.H reads from mesh.solutionDict()
targetResP  0.1;   // pEqn.H reads from mesh.solutionDict()
compInterFoamCoeffs
{
    maxReasonableVelocity  250;     // UEqn.H
    defaultMetalDensity    4500;    // UEqn.H (fallback if rho1 invalid)
    defaultAirDensity      1.2;     // UEqn.H (fallback if rho2 invalid)
    maxVelocity            1000;    // UEqn.H velocity limiter
    targetResU             0.1;     // UEqn.H adaptive relaxation driver
}

