TestThesis/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
    // Substrate: y in [0, 8 µm]
    {
        name        substrate;
        type        cellSet;
        action      new;
        source      boxToCell;
        sourceInfo
        {
            box (0 0 0) (50e-6 8e-6 10e-6);
        }
    }
    {
        name        substrate;
        type        cellZoneSet;
        action      new;
        source      setToCellZone;
        sourceInfo { set substrate; }
    }

    // Metal film: y in [8, 10 µm]
    {
        name        metalFilm;
        type        cellSet;
        action      new;
        source      boxToCell;
        sourceInfo
        {
            box (0 8e-6 0) (50e-6 10e-6 10e-6);
        }
    }
    {
        name        metalFilm;
        type        cellZoneSet;
        action      new;
        source      setToCellZone;
        sourceInfo { set metalFilm; }
    }
);
// ************************************************************************* //
